#Задача 14: 
N = int(input('Введите число N '))
print(f"Степени двойки, не больше {N}:")
stepen2=1
print(stepen2)
while stepen2<=N :
    stepen2*=2
    if stepen2<=N:
         print(stepen2)





      
